; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Plant watering domain - metric-ff version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; An agent on a grid-like map aims pos watering some plants by
;;; carrying water from a tap to the plants.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; Adapted to do away with the grid (Enrico Scala & Miquel Ramirez, August 2015)
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain assembly-line-constrained)
    (:types
        unit zone - object
        robot_arm workstation stock_bin - unit
    )
    ; (:predicates
    ;    (CONNECTED ?x ?y - location) ;; Whether two locations are connected.
    ;)

    (:functions
        (east_edge) ;; bounds
        (north_edge) ;; bounds
        (south_edge) ;; bounds
        (west_edge) ;; bounds
        (col ?t - unit) ;; x coordinate of the location for ?t
        (row ?t - unit) ;; y coordinate of the location for ?t
        (held_stock) ;; The amount of water carried by the agent.
        (delivered_to ?p - workstation) ;; The amount of water poured to the plant so far.
        (total_delivered) ;; The total amount of water poured so far.
        (total_drawn) ;; The total amount of water retrieved from the tap.
        (ceiling) ;; The maximum integer we consider - a static value
    )

    ;; Move an agent to a neighboring location
    (:action roll_north
        :parameters (?a - robot_arm)
        :precondition (and (<= (+ (row ?a) 1) (north_edge)))
        :effect (and
            (increase (row ?a) 1))
    )

    (:action roll_south
        :parameters (?a - robot_arm)
        :precondition (and (>= (- (row ?a) 1) (south_edge)))
        :effect (and
            (decrease (row ?a) 1))
    )

    (:action roll_east
        :parameters (?a - robot_arm)
        :precondition (and (<= (+ (col ?a) 1) (east_edge)))
        :effect (and
            (increase (col ?a) 1))
    )

    (:action roll_west
        :parameters (?a - robot_arm)
        :precondition (and (>= (- (col ?a) 1) (west_edge)))
        :effect (and
            (decrease (col ?a) 1))
    )

    (:action roll_northwest
        :parameters (?a - robot_arm)
        :precondition (and (>= (- (col ?a) 1) (west_edge)) (<= (+ (row ?a) 1) (north_edge)))
        :effect (and
            (increase (row ?a) 1) (decrease (col ?a) 1))
    )

    (:action roll_northeast
        :parameters (?a - robot_arm)
        :precondition (and (<= (+ (col ?a) 1) (east_edge)) (<= (+ (row ?a) 1) (north_edge)))
        :effect (and
            (increase (row ?a) 1) (increase (col ?a) 1))
    )

    (:action roll_southwest
        :parameters (?a - robot_arm)
        :precondition (and (>= (- (col ?a) 1) (west_edge)) (>= (- (row ?a) 1) (south_edge)))
        :effect (and
            (decrease (col ?a) 1) (decrease (row ?a) 1))
    )

    (:action roll_southeast
        :parameters (?a - robot_arm)
        :precondition (and (<= (+ (col ?a) 1) (east_edge)) (>= (- (row ?a) 1) (south_edge)))
        :effect (and
            (decrease (row ?a) 1) (increase (col ?a) 1))
    )

    ;; Load one unit of water from a tap into the agent's bucket.
    (:action draw_stock
        :parameters (?a - robot_arm ?t - stock_bin)
        :precondition (and (= (col ?a) (col ?t)) (=(row ?a) (row ?t))
            (<= (+ (total_drawn) 1) (ceiling))
            (<= (+ (held_stock) 1) (ceiling))
        )
        :effect (and (increase (held_stock) 1) (increase (total_drawn) 1))
    )

    ;; Pours one unit of water from the agent's bucket into a plant.
    (:action deliver_stock
        :parameters (?a - robot_arm ?p - workstation)
        :precondition (and (= (col ?a) (col ?p)) (=(row ?a) (row ?p))
            (>= (held_stock) 1)
            (<= (+ (total_delivered) 1) (ceiling))
            (<= (+ (delivered_to ?p) 1) (ceiling))
        )
        :effect (and
            (decrease (held_stock) 1)
            (increase (delivered_to ?p) 1)
            (increase (total_delivered) 1)
        )
    )
)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_7_1_2)
  (:domain assembly-line-constrained)
  (:objects
    robot_arm1 - robot_arm
  stock_bin1 - stock_bin
  workstation1 - workstation
  )

  (:init
    (= (ceiling) 20)
  (= (east_edge) 7)
  (= (west_edge) 1)
  (= (north_edge) 7)
  (= (south_edge) 1)
  (= (held_stock) 0)
  (= (total_delivered) 0)
  (= (total_drawn) 0)
  (= (delivered_to workstation1) 0)
  (= (col robot_arm1) 4)
  (= (row robot_arm1) 3)
  (= (col workstation1) 3)
  (= (row workstation1) 3)
  (= (col stock_bin1) 2)
  (= (row stock_bin1) 2)
  )

  (:goal (and
    (= (delivered_to workstation1) 9)
  (= (total_delivered) (delivered_to workstation1) )
  ))





)

; plan
1. (roll_southwest robot_arm1)
   changed: (col robot_arm1) from 4 to 3, (row robot_arm1) from 3 to 2
   goals met: 1 of 2
2. (roll_west robot_arm1)
   changed: (col robot_arm1) from 3 to 2
   goals met: 1 of 2
3. (draw_stock robot_arm1 stock_bin1)
   changed: (held_stock) from 0 to 1, (total_drawn) from 0 to 1
   goals met: 1 of 2
4. (draw_stock robot_arm1 stock_bin1)
   changed: (held_stock) from 1 to 2, (total_drawn) from 1 to 2
   goals met: 1 of 2
5. (roll_northeast robot_arm1)
   changed: (row robot_arm1) from 2 to 3, (col robot_arm1) from 2 to 3
   goals met: 1 of 2
6. (deliver_stock robot_arm1 workstation1)
   changed: (held_stock) from 2 to 1, (delivered_to workstation1) from 0 to 1, (total_delivered) from 0 to 1
   goals met: 1 of 2
7. (roll_southwest robot_arm1)
   changed: (col robot_arm1) from 3 to 2, (row robot_arm1) from 3 to 2
   goals met: 1 of 2
8. (draw_stock robot_arm1 stock_bin1)
   changed: (held_stock) from 1 to 2, (total_drawn) from 2 to 3
   goals met: 1 of 2
9. (roll_northeast robot_arm1)
   changed: (row robot_arm1) from 2 to 3, (col robot_arm1) from 2 to 3
   goals met: 1 of 2
10. (deliver_stock robot_arm1 workstation1)
   changed: (held_stock) from 2 to 1, (delivered_to workstation1) from 1 to 2, (total_delivered) from 1 to 2
   goals met: 1 of 2
11. (deliver_stock robot_arm1 workstation1)
   changed: (held_stock) from 1 to 0, (delivered_to workstation1) from 2 to 3, (total_delivered) from 2 to 3
   goals met: 1 of 2
12. (roll_southwest robot_arm1)
   changed: (col robot_arm1) from 3 to 2, (row robot_arm1) from 3 to 2
   goals met: 1 of 2
13. (draw_stock robot_arm1 stock_bin1)
   changed: (held_stock) from 0 to 1, (total_drawn) from 3 to 4
   goals met: 1 of 2
14. (roll_northeast robot_arm1)
   changed: (row robot_arm1) from 2 to 3, (col robot_arm1) from 2 to 3
   goals met: 1 of 2
15. (deliver_stock robot_arm1 workstation1)
   changed: (held_stock) from 1 to 0, (delivered_to workstation1) from 3 to 4, (total_delivered) from 3 to 4
   goals met: 1 of 2
16. (roll_southwest robot_arm1)
   changed: (col robot_arm1) from 3 to 2, (row robot_arm1) from 3 to 2
   goals met: 1 of 2
17. (draw_stock robot_arm1 stock_bin1)
   changed: (held_stock) from 0 to 1, (total_drawn) from 4 to 5
   goals met: 1 of 2
18. (draw_stock robot_arm1 stock_bin1)
   changed: (held_stock) from 1 to 2, (total_drawn) from 5 to 6
   goals met: 1 of 2
19. (roll_northeast robot_arm1)
   changed: (row robot_arm1) from 2 to 3, (col robot_arm1) from 2 to 3
   goals met: 1 of 2
20. (deliver_stock robot_arm1 workstation1)
   changed: (held_stock) from 2 to 1, (delivered_to workstation1) from 4 to 5, (total_delivered) from 4 to 5
   goals met: 1 of 2
21. (roll_southwest robot_arm1)
   changed: (col robot_arm1) from 3 to 2, (row robot_arm1) from 3 to 2
   goals met: 1 of 2
22. (draw_stock robot_arm1 stock_bin1)
   changed: (held_stock) from 1 to 2, (total_drawn) from 6 to 7
   goals met: 1 of 2
23. (roll_northeast robot_arm1)
   changed: (row robot_arm1) from 2 to 3, (col robot_arm1) from 2 to 3
   goals met: 1 of 2
24. (deliver_stock robot_arm1 workstation1)
   changed: (held_stock) from 2 to 1, (delivered_to workstation1) from 5 to 6, (total_delivered) from 5 to 6
   goals met: 1 of 2
25. (roll_southwest robot_arm1)
   changed: (col robot_arm1) from 3 to 2, (row robot_arm1) from 3 to 2
   goals met: 1 of 2
26. (draw_stock robot_arm1 stock_bin1)
   changed: (held_stock) from 1 to 2, (total_drawn) from 7 to 8
   goals met: 1 of 2
27. (roll_northeast robot_arm1)
   changed: (row robot_arm1) from 2 to 3, (col robot_arm1) from 2 to 3
   goals met: 1 of 2
28. (deliver_stock robot_arm1 workstation1)
   changed: (held_stock) from 2 to 1, (delivered_to workstation1) from 6 to 7, (total_delivered) from 6 to 7
   goals met: 1 of 2
29. (roll_southwest robot_arm1)
   changed: (col robot_arm1) from 3 to 2, (row robot_arm1) from 3 to 2
   goals met: 1 of 2
30. (draw_stock robot_arm1 stock_bin1)
   changed: (held_stock) from 1 to 2, (total_drawn) from 8 to 9
   goals met: 1 of 2
31. (roll_northeast robot_arm1)
   changed: (row robot_arm1) from 2 to 3, (col robot_arm1) from 2 to 3
   goals met: 1 of 2
32. (deliver_stock robot_arm1 workstation1)
   changed: (held_stock) from 2 to 1, (delivered_to workstation1) from 7 to 8, (total_delivered) from 7 to 8
   goals met: 1 of 2
33. (deliver_stock robot_arm1 workstation1)
   changed: (held_stock) from 1 to 0, (delivered_to workstation1) from 8 to 9, (total_delivered) from 8 to 9
   goals met: 2 of 2
